#+TITLE: reformr プロジェクトノート
#+PROPERTY: header-args :session *R:tidyNAS*
* パッケージ開発の準備
:LOGBOOK:
CLOCK: [2018-12-16 Sun 12:45]--[2018-12-16 Sun 13:13] =>  0:28
:END:
*** DONE パッケージ dir を作る
:LOGBOOK:
CLOCK: [2018-12-26 Wed 11:49]--[2018-12-26 Wed 12:18] =>  0:29
:END:
#+BEGIN_SRC R
  setwd("/Users/ahayashi/Documents/GitHub/tidyNAS/")
  list.files()
#  devtools::create("reformr")
#+END_SRC

#+RESULTS:


** 使用したパッケージ
#+BEGIN_SRC R :results silent :exports code
usethis::use_package("magrittr", type = "Imports")
usethis::use_package("dplyr", type = "Imports")
usethis::use_package("lubridate", type = "Imports")
usethis::use_package("readxl", type = "Imports")
usethis::use_package("stringr", type = "Imports")
#+END_SRC

#+BEGIN_SRC sh :session nil :results output :exports results
cat reformr/DESCRIPTION
#+END_SRC

#+RESULTS:
: DESCRIPTION	NAMESPACE	R		reformr.Rproj	tests
** 再ロード & 自動テスト
#+BEGIN_SRC R :exports both :results silent
  devtools::load_all()
  system("R CMD INSTALL --preclean --no-multiarch --with-keep.source .")
  devtools::test()
  devtools::document(roclets=c('rd', 'collate', 'namespace'))
#+END_SRC

#+RESULTS: load_data
| 鮮魚測定06/カタクチイワシ.xls |
| 鮮魚測定06/マイワシ.xls       |
| 鮮魚測定07/カタクチイワシ.xls |
| 鮮魚測定07/マイワシ.xls       |
| 鮮魚測定08/カタクチイワシ.xls |
| 鮮魚測定08/マイワシ.xls       |
| 鮮魚測定09/カタクチイワシ.xls |
| 鮮魚測定09/マイワシ.xls       |
| 鮮魚測定10/カタクチイワシ.xls |
| 鮮魚測定10/マイワシ.xls       |
| 鮮魚測定11/カタクチイワシ.xls |
| 鮮魚測定11/マイワシ.xls       |
| 鮮魚測定12/カタクチイワシ.xls |
| 鮮魚測定12/マイワシ.xls       |
| 鮮魚測定13/カタクチイワシ.xls |
| 鮮魚測定13/マイワシ.xls       |
| 鮮魚測定14/カタクチイワシ.xls |
| 鮮魚測定14/マイワシ.xls       |
| 鮮魚測定15/カタクチイワシ.xls |
| 鮮魚測定15/マイワシ.xls       |
| 鮮魚測定16/カタクチイワシ.xls |
| 鮮魚測定16/マイワシ.xls       |
| 鮮魚測定17/カタクチイワシ.xls |
| 鮮魚測定17/マイワシ.xls       |
| 鮮魚測定18/カタクチイワシ.xls |
| 鮮魚測定18/マイワシ.xls       |
| 鮮魚測定19/カタクチイワシ.xls |
| 鮮魚測定19/マイワシ.xls       |

* 再ロードしてテストする
#+BEGIN_SRC R :results table
  devtools::load_all("reformr")
  devtools::test("reformr")
#+END_SRC

#+RESULTS:
| test_filestring.R | Parse file and sheet names | make_datlist make data list correctly                            |  2 | 0 | FALSE | FALSE | 0 |  0.00199999999999889 |                   0 | 0.00199999999949796 |
| test_filestring.R | Parse file and sheet names | parse_year() puts year list correctly                            |  7 | 0 | FALSE | FALSE | 0 |  0.00600000000000023 | 0.00099999999999989 | 0.00700000000051659 |
| test_filestring.R | Parse file and sheet names | get_filelist() puts species file list correctly                  |  4 | 0 | FALSE | FALSE | 0 |  0.00499999999999901 | 0.00100000000000011 | 0.00599999999940337 |
| test_filestring.R | Parse file and sheet names | get_sheet2read() puts sheets to read                             |  4 | 0 | FALSE | FALSE | 0 |  0.00400000000000134 | 0.00099999999999989 | 0.00700000000051659 |
| test_filestring.R | Parse file and sheet names | get_date() parses dates correctly                                |  4 | 0 | FALSE | FALSE | 0 |  0.00900000000000034 |                   0 | 0.00900000000001455 |
| test_format.R     | Formatting loaded data     | format() make datcols correctly                                  |  7 | 0 | FALSE | FALSE | 0 |   0.0399999999999991 | 0.00099999999999989 |  0.0420000000003711 |
| test_format.R     | Formatting loaded data     | format() cleanses length and weight columns correctly            | 12 | 0 | FALSE | FALSE | 0 |    0.116000000000003 | 0.00299999999999989 |   0.118999999999687 |
| test_format.R     | Formatting loaded data     | format() cleanses otolith and scale columns correctly            |  1 | 0 | FALSE | FALSE | 0 |  0.00999999999999801 | 0.00100000000000011 |   0.011000000000422 |
| test_param.R      | Handle param object        | make_params accept only 'sengyo' or 'cruise'                     |  2 | 0 | FALSE | FALSE | 0 |  0.00200000000000244 |                   0 | 0.00200000000040745 |
| test_param.R      | Handle param object        | make_params accept only 'カタクチイワシ', 'マイワシ' or 'マアジ' |  2 | 0 | FALSE | FALSE | 0 | 0.000999999999997669 |                   0 | 0.00199999999949796 |

